controllers/SiteController.php

SELECT COUNT(*) FROM `preke` WHERE `kategorija_id`='2'
SELECT * FROM `preke` WHERE `kategorija_id`='2' ORDER BY `pavadinimas` DESC
---
	public function actionGautiprekes($id){
		$skaiciuotiPrekes = Preke::find()
                ->where(['kategorija_id' => $id])
                ->count();

        $prekes = Preke::find()
                ->where(['kategorija_id' => $id])
                ->orderBy('pavadinimas DESC')
                ->all();